<UNK>
保
障
女
性
哪
些
手
术
意
外
伤
害
面
部
整
形
、
烧
植
皮
全
乳
房
切
除
子
宫
卵
巢
输
管
肌
瘤
。
只
要
如
实
告
知
，
续
时
不
因
被
险
人
个
身
体
状
况
或
发
生
理
赔
而
单
独
调
费
承
公
司
怎
么
查
看
点
击
产
品
「
购
买
须
」
页
《
条
款
》
后
在
详
情
即
可
见
投
您
以
小
米
钱
包

→
币
充
值
里
进
行
获
得
也
多
关
注
加
游
戏
主
题
M
I
U
论
坛
等
活
动
会
有
一
定
的
福
利
支
付
额
度
变
吗
每
家
银
限
同
且
能
化
建
议
询
卡
我
道
成
0
了
很
抱
歉
若
贷
首
没
显
示
是
由
于
综
合
评
估
通
过
干
脆
根
据
用
户
结
果
当
系
统
检
测
到
账
使
习
惯
良
好
将
为
恢
复
期
本
仅
室
内
财
太
阳
设
备
和
空
机
范
围
之
庭
雇
佣
员
偷
盗
分
何
审
核
呀
识
别
转
跳
工
需
提
供
持
份
证
自
拍
照
片
正
们
作
1
-
3
日
完
帅
哥
具
智
慧
退
请
直
接
联
:
<
a
h
r
e
f
=
"
t
l
9
5
>
/
4
还
金
(
6
天
数
)
*
.
客
极
致
版
,
报
销
门
诊
住
院
前
7
出
急
上
述
其
他
治
疗
仍
己
二
：
无
社
元
法
绑
交
易
超
次
般
原
导
异
常
服
 
针
对
（
N
o
2
）
红
屏
幕
损
坏
务
共
两
方
案
选
择
现
未
中
余
打
开
A
P
“
”
操
b
长
间
反
馈
北
京
月
凭
功
截
图
号
及
信
息
东
西
南
站
三
心
领
取
票
苏
州
市
民
记
录
去
武
汉
程
技
湖
省
洪
山
区
融
科
珞
瑜
T
写
字
楼
深
圳
应
商
店
下
载
鹏
淘
端
吉
林
船
营
大
街
8
八
厦
座
台
城
待
说
明
【
】
名
认
失
败
处
收
益
货
基
与
指
+
算
再
例
d
i
v
c
s
k
x
m
g
p
逾
忘
话
那
找
回
感
谢
解
密
码
邮
箱
相
n
u
w
这
按
流
立
你
安
装
升
？
计
优
秀
高
地
软
件
际
准
重
置
久
申
材
料
新
哎
呦
！
模
拟
登
态
才
该
张
医
什
构
括
符
列
境
级
含
规
标
并
十
四
格
师
护
士
但
康
养
戒
酒
毒
者
类
似
目
资
橘
色
块
入
总
览
累
迄
今
止
所
右
角
历
史
奖
效
填
址
扣
起
否
足
够
另
界
耐
候
尝
试
拨
电
咨
芯
官
售
纳
尼
想
执
S
帐
彻
底
删
验
换
周
允
许
册
聊
暂
编
辑
遇
决
吃
胃
口
万
车
航
就
依
国
卫
甲
精
神
病
平
谷
云
县
怀
柔
英
语
鹰
言
低
啊
y
附
近
觉
木
绿
项
延
线
已
清
弘
更
书
D
q
_
R
E
放
式
业
表
达
z
H
Y
网
虹
均
容
亲
笔
签
疑
问
热
制
链
浏
器
[
]
积
配
政
策
求
慎
继
路
径
爱
影
任
随
华
寿
嗯
喜
欢
球
错
协
办
旦
给
运
温
馨
仔
细
免
造
必
贵
钮
物
此
刚
速
爷
死
改
遗
特
殊
j
?
#
!
传
卓
O
尚
始
束
来
哟
嘿
固
年
龄
确
越
比
参
考
少
呢
漫
摄
都
零
哦
初
岁
；
股
组
追
踪
%
跟
涨
跌
属
型
较
研
究
聘
批
析
花
价
向
券
学
经
避
风
又
赚
最
佳
拜
难
抢
第
责
步
骤
排
刷
纹
修
维
碎
迎
阅
读
微
众
约
缴
先
事
位
域
讲
笑
冬
满
雪
气
冷
母
妈
穿
衣
暖
猫
儿
倒
冻
呆
毛
抵
几
校
暑
假
忽
然
从
嚷
眯
光
赤
老
早
披
着
厚
怕
它
拿
剪
刀
替
存
迟
则
滚
啦
辆
闪
借
把
适
添
至
样
享
受
惠
骂
缓
络
环
患
种
疾
走
吧
焉
牛
文
差
左
封
闭
非
顺
权
摸
哭
听
嘛
友
掉
水
做
朋
带
困
扰
~
节
休
男
助
量
订
嘎
钛
推
荐
孩
枚
突
快
捷
送
令
匹
预
留
剩
麻
烦
乙
丙
谈
世
劳
苦
消
马
莫
鱼
惑
答
虽
晚
睡
像
往
泳
岂
恩
希
望
玩
愉
率
减
骉
专
牌
强
负
诺
质
短
代
净
克
黄
划
旨
概
补
哈
哒
诈
骗
透
露
偿
Q
索
啥
某
距
离
健
途
抽
恋
激
引
笨
监
团
返
各
尽
津
冀
互
郊
河
唐
铁
键
真
愿
担
恶
肿
偶
父
&
误
犹
豫
白
响
断
力
终
F
脑
赎
卖
①
轻
症
故
②
兼
顾
储
蓄
C
爸
乘
坐
飞
场
班
舱
残
群
敢
授
钟
末
峰
集
稳
富
裕
熟
悉
企
债
撤
刻
础
沈
|
海
广
岭
杭
祝
柜
叫
疼
屁
启
逗
序
锁
盈
稍
跑
唱
汽
陪
宾
畴
昂
百
驾
粗
X
覆
盖
景
违
幸
逼
贝
毕
归
罚
寻
帮
丑
美
聪
绝
顶
宝
便
涵
增
虑
傻
赶
紧
临
谅
闸
旧
头
脸
嘴
眨
眼
递
饿
猜
礼
盒
兑
渠
扫
敬
昨
咋
洁
麽
画
闲
努
拥
乐
趣
探
视
沟
啵
赠
频
倍
火
轨
旅
巴
渤
贴
背
描
颜
默
音
呼
唤
忧
唯
肾
射
疫
泌
靶
移
抗
称
简
拼
缺
G
普
醒
段
防
双
童
折
～
思
观
察
／
喂
禁
诚
阶
逐
渐
药
济
压
纸
镜
梨
庆
丢
旁
≤
呈
谁
教
舍
私
@
姓
晰
半
诉
猪
肉
炖
粉
却
布
蛋
味
血
胞
骨
髓
织
控
浸
润
床
象
液
义
宽
油
攻
略
赋
;
瞬
闷
靠
逆
连
寄
弃
六
五
素
募
严
遵
守
隐
律
采
泄
桌
悬
浮
盘
展
宣
╭
╯
╰
╮
誉
豁
哇
判
扭
既
永
肢
腕
踝
丧
咀
嚼
吞
咽
枢
胸
腹
脏
碍
命
扶
脱
畅
涉
妥
善
挂
楚
阻
『
』
培
训
练
掌
握
措
施
潜
滑
冰
驶
翔
翼
伞
攀
岩
赛
摔
跤
跆
拳
演
丁
蹦
谨
厂
袋
励
哔
哩
犯
罪
租
胁
迫
循
滞
讼
秒
七
轮
章
彩
宇
宙
敌
拔
诗
降
局
甄
芝
夜
泪
祸
趋
徐
憾
咯
酷
争
架
春
斗
叔
浪
播
舟
襄
停
季
冲
丰
漂
亮
栏
介
绍
农
午
阿
姨
羊
毫
星
狼
．
词
喽
仓
阴
汪
兔
远
酌
祖
宗
捉
哼
势
让
九
千
燃
勾
欠
翻
职
陆
港
澳
遭
饭
奇
艺
松
杀
悟
瘦
煮
鸡
嫉
妒
⊙
﹏
汗
弄
嘞
嘻
尊
娩
曾
危
呵
夸
嗨
破
裂
邻
居
占
斥
志
喷
王
荣
耀
咦
混
×
亡
孝
癌
叠
军
僻
族
咱
俩
曰
沒
姐
佛
江
肇
茂
揭
韶
源
湛
梅
珠
汕
尾
潮
宁
忙
棒
阔
桃
籍
派
印
嚎
予
屎
暴
躁
振
亚
搭
孕
妊
娠
B
L
啪
舞
青
晨
傍
托
嫲
丽
＝
＊
德
帖
巧
石
赫
兹
亏
蔽
拦
肠
炎
救
援
土
梦
歌
声
食
挣
召
妇
层
仪
板
聚
酶
磁
窥
肺
尿
瑞
慈
宿
迁
皋
斯
徽
肥
塔
滨
辖
浙
川
辽
届
膳
静
脉
膜
委
婉
羞
央
扩
散
淋
腔
肝
腺
慢
杰
氏
肤
黑
染
艾
滋
爆
炸
狗
虚
妹
套
餐
搜
·
洽
府
颁
蹭
孙
僧
村
姑
婆
辜
怜
俊
－
＋
税
垫
迅
婴
呱
洗
妆
香
炉
紫
烟
兴
睛
鼻
瘫
痪
罹
赡
J
饱
挑
甘
肃
龙
仰
滔
绵
泛
滥
拾
释
榜
灵
槛
懒
赖
莞
械
耳
厉
惹
招
浦
颈
肚
遍
插
茱
萸
念
喝
捂
矮
胖
匠
讨
厌
钳
舔
访
陷
灾
窃
疏
碰
撞
腐
蚀
池
漏
涌
虫
磨
痕
拆
螺
丝
欺
卷
厕
桶
拒
耗
库
捆
橙
草
莓
尔
埃
塞
俄
拉
坦
勒
波
隆
迪
帝
汶
厄
瓜
菲
冈
伦
鲁
圭
蓬
柬
埔
寨
泰
缅
甸
边
瓦
宋
韦
喀
麦
肯
莱
黎
嫩
卢
旺
顿
孟
秘
桑
洲
泊
兰
威
丹
汤
乌
叙
伊
朗
齐
古
曼
赞
乍
摩
罗
萨
岛
撒
宜
昌
汇
犀
凤
挤
坠
落
薯
创
乡
瞎
博
呗
跨
勿
妞
讯
…
郑
涪
陵
劫
夺
捏
乖
闹
雷
谋
呜
Ⅰ
妖
举
苹
嫌
窝
圆
迹
灭
荷
缩
咧
奥
慰
寒
懂
弥
唠
嗑
杂
履
勤
搬
兵
战
嗜
锅
寐
噢
鬼
焦
圈
崩
煤
繁
琐
嘘
旗
斑
疮
枝
眠
盐
門
俏
镇
怪
挺
傲
娇
婚
麼
犊
菜
奔
犄
旮
旯
甜
蜜
饯
嗎
垃
圾
陡
灰
耍
撩
愚
喵
咪
串
裏
‘
羡
慕
淡
喔
娜
蔡
吓
檩
诬
壳
霜
娘
携
唉
党
映
熊
湾
谦
译
凡
庄
沙
昆
浩
咔
吼
雨
玛
朝
育
幼
园
挖
缎
饰
乱
魅
秋
呐
鞋
隔
席
杯
喘
李
恭
W
糕
陌
废
猴
厅
捡
扁
剛
請
額
況
撸
咩
顯
綁
賬
戶
奏
猝
耶
粤
辛
兄
弟
伙
伴
過
筋
弯
挡
貸
擅
厢
筹
＞
鞭
炮
骑
濮
蘑
菇
滴
砍
偏
跪
洛
瓶
😯
K
搞
泥
绕
拓
乎
烂
銀
卞
％
催
锡
锦
晋
沂
吕
梁
犁
鄂
⽀
辣
烫
乃
赁
陕
睐
粒
锄
禾
皆
钥
匙
還
涯
邦
谱
苟
旋
冒
巳
君
愁
课
剁
辈
慌
無
錄
錢
藏
鹤
😓
復
辩
😭
盛
鄉
證
來
內
實
認
ρ
臭
迦
啰
遥
踏
拖
肖
幣
押
舒
吹
纪
梆
別
朱
爹
〔
〕
宠
疆
咸
'
征
💰
恨
陸
堰
´
◡
`
痛
開
驗
誤
⾯
⽐
😔
宏
⽆
妙
愈
